src/cf/Enums/ИсточникФинансирования.xml
<?xml version='1.0' encoding='UTF-8' standalone='yes'?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ИсточникФинансирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Бюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Внебюджет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ЕдИзм.xml
<?xml version='1.0' encoding='UTF-8' standalone='yes'?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЕдИзм</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Процент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаПервогоРазряда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БазВеличина</Name>
				</Properties>
			</EnumValue>
		<EnumValue>
				<Properties>
					<Name>ПроцентСтПервогоРазряда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БазоваяСтавка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцентБазовойСтавки</Name>
				</Properties>
			</EnumValue>
			</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидПечатиНадбавок.xml
<?xml version='1.0' encoding='UTF-8' standalone='yes'?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидПечатиНадбавок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РазмерСумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Размер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтатусыНадбавок.xml
<?xml version='1.0' encoding='UTF-8' standalone='yes'?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыНадбавок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НадбБазовойСт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НадбЗаЗвание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НадбЗаСтепень</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НадбавкаОклада</Name>
				</Properties>
			</EnumValue>
			</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/УстановщикНадбавки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>УстановщикНадбавки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наниматель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПОО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профсоюз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/Пол.xml
<?xml version='1.0' encoding='UTF-8' standalone='yes'?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Пол</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СемейноеПоложение.xml
<?xml version='1.0' encoding='UTF-8' standalone='yes'?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СемейноеПоложение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Х</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Р</Name>
				</Properties>
			</EnumValue>
		<EnumValue>
				<Properties>
					<Name>В</Name>
				</Properties>
			</EnumValue>
			</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/КодыМобильныхОператоровБеларуси.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КодыМобильныхОператоровБеларуси</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>A1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Life</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ДокументыУдостоверяющиеЛичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДокументыУдостоверяющиеЛичность</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПаспортРБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидНаЖительство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдостоверениеБеженца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РазрешениеНаВременноеПроживание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СтраныМира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтраныМира</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Беларусь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Россия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДругаяСтрана</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/CommonModules/ДемоДанныеСервер/Ext/Module.bsl
// Модуль загрузки классификатора ОКСМ и демонстрационных данных.
// Запуск: параметр запуска "ЗагрузитьДемоДанные" (1cv8 ENTERPRISE /C ЗагрузитьДемоДанные).

#Область ПрограммныйИнтерфейс

Процедура ЗагрузитьДемоДанные() Экспорт
	ЗагрузитьТипыАдресов();
	ЗагрузитьАдреса();
	ЗагрузитьБанки();
	ЗагрузитьГруппы();
	ЗагрузитьВидыДолжностей();
	ЗагрузитьКлассификаторЗанятий();
	ЗагрузитьСтраныМира();
	ЗагрузитьНадбавки();
	ЗагрузитьПодразделения();
	ЗагрузитьДолжности();
	ЗагрузитьСотрудников();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиИлиСоздатьЭлемент(ИмяСправочника, Наименование, Код = Неопределено)
	Ссылка = Справочники[ИмяСправочника].НайтиПоНаименованию(Наименование, Истина);
	Если ЗначениеЗаполнено(Ссылка) И Не Ссылка.Пустая() Тогда
		Возврат Ссылка;
	КонецЕсли;
	Объект = Справочники[ИмяСправочника].СоздатьЭлемент();
	Объект.Наименование = Наименование;
	Если Код <> Неопределено Тогда
		Объект.Код = Код;
	КонецЕсли;
	Объект.Записать();
	Возврат Объект.Ссылка;
КонецФункции

Функция НовыйЭлементСправочника(ИмяСправочника, Код, Наименование)
	Объект = Справочники[ИмяСправочника].СоздатьЭлемент();
	Объект.Код = Код;
	Объект.Наименование = Наименование;
	Возврат Объект;
КонецФункции

Функция НайтиИлиСоздатьГруппу(ИмяСправочника, Наименование)
	Ссылка = Справочники[ИмяСправочника].НайтиПоНаименованию(Наименование, Истина);
	Если ЗначениеЗаполнено(Ссылка) И Не Ссылка.Пустая() Тогда
		Возврат Ссылка;
	КонецЕсли;
	Объект = Справочники[ИмяСправочника].СоздатьГруппу();
	Объект.Наименование = Наименование;
	Объект.Записать();
	Возврат Объект.Ссылка;
КонецФункции

Процедура ЗагрузитьТипыАдресов()
	МассивТиповНП = Новый Массив;
	МассивТиповНП.Добавить("г.");
	МассивТиповНП.Добавить("аг.");
	МассивТиповНП.Добавить("п.");
	МассивТиповНП.Добавить("д.");
	Для Каждого Тип Из МассивТиповНП Цикл
		НайтиИлиСоздатьЭлемент("ТипНаселенногоПункта", Тип);
	КонецЦикла;
	МассивТиповУлиц = Новый Массив;
	МассивТиповУлиц.Добавить("ул.");
	МассивТиповУлиц.Добавить("пр-т");
	МассивТиповУлиц.Добавить("пер.");
	МассивТиповУлиц.Добавить("б-р");
	МассивТиповУлиц.Добавить("пл.");
	Для Каждого Тип Из МассивТиповУлиц Цикл
		НайтиИлиСоздатьЭлемент("ТипУлицы", Тип);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьАдреса()
	Область = НайтиИлиСоздатьГруппу("Адрес", "Минская область");
	Минск = НайтиИлиСоздатьГруппу("Адрес", "г. Минск");
	ОбъектМинск = Минск.ПолучитьОбъект();
	Если Не ЗначениеЗаполнено(ОбъектМинск.Родитель) Тогда
		ОбъектМинск.Родитель = Область;
		ОбъектМинск.Записать();
	КонецЕсли;
	Улица = НайтиИлиСоздатьЭлемент("Адрес", "ул. Платонова");
	ОбъектУлица = Улица.ПолучитьОбъект();
	Если Не ЗначениеЗаполнено(ОбъектУлица.Родитель) Тогда
		ОбъектУлица.Родитель = Минск;
		ОбъектУлица.Записать();
	КонецЕсли;
	Проспект = НайтиИлиСоздатьЭлемент("Адрес", "пр-т Независимости");
	ОбъектПроспект = Проспект.ПолучитьОбъект();
	Если Не ЗначениеЗаполнено(ОбъектПроспект.Родитель) Тогда
		ОбъектПроспект.Родитель = Минск;
		ОбъектПроспект.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ЗагрузитьБанки()
	Банк1 = НовыйЭлементСправочника("БанкиРБ", "000000001", "ОАО «АСБ Беларбанк»");
	Банк1.МФО = "151501602";
	Банк1.АдресБанка = "г. Минск, пр-т Независимости, 32";
	Банк1.Записать();
	Банк2 = НовыйЭлементСправочника("БанкиРБ", "000000002", "ОАО «Белагропромбанк»");
	Банк2.МФО = "153001602";
	Банк2.АдресБанка = "г. Минск, ул. Карла Маркса, 4";
	Банк2.Записать();
КонецПроцедуры

Процедура ЗагрузитьГруппы()
	Группы = Новый Массив;
	Группы.Добавить("Не требуется");
	Группы.Добавить("Раз в 3 года");
	Группы.Добавить("Раз в 5 лет");
	Для Каждого Имя Из Группы Цикл
		НайтиИлиСоздатьЭлемент("ГруппаДляПовышенияКвалификации", Имя);
	КонецЦикла;
	ГруппыППС = Новый Массив;
	ГруппыППС.Добавить("Профессорско-преподавательский состав");
	ГруппыППС.Добавить("Научные работники");
	Для Каждого Имя Из ГруппыППС Цикл
		НайтиИлиСоздатьЭлемент("ГруппаДляППС", Имя);
	КонецЦикла;
	ГруппыСтат = Новый Массив;
	ГруппыСтат.Добавить("Научные работники");
	ГруппыСтат.Добавить("ППС");
	ГруппыСтат.Добавить("Другие работники");
	Для Каждого Имя Из ГруппыСтат Цикл
		НайтиИлиСоздатьЭлемент("ГруппаДляСтатОтчетности", Имя);
	КонецЦикла;
	ГруппыМинТруда = Новый Массив;
	ГруппыМинТруда.Добавить("Руководители");
	ГруппыМинТруда.Добавить("Специалисты");
	ГруппыМинТруда.Добавить("Другие служащие");
	ГруппыМинТруда.Добавить("Рабочие");
	Для Каждого Имя Из ГруппыМинТруда Цикл
		НайтиИлиСоздатьЭлемент("ГруппаДляМинТруда", Имя);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьВидыДолжностей()
	Виды = Новый Массив;
	Виды.Добавить("ВФ");
	Виды.Добавить("Другие служащие");
	Виды.Добавить("Преподаватели");
	Виды.Добавить("рабочие");
	Виды.Добавить("руководители");
	Виды.Добавить("руководители ППС");
	Виды.Добавить("специалисты");
	Для Каждого Имя Из Виды Цикл
		НайтиИлиСоздатьЭлемент("ВидДолжности", Имя);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьКлассификаторЗанятий()
	Занятия = Новый Массив;
	Занятия.Добавить("1231 Руководители учреждений, организаций и предприятий");
	Занятия.Добавить("2441 Библиотечные работники");
	Занятия.Добавить("2351 Преподаватели университетов и других учреждений высшего образования");
	Занятия.Добавить("4110 Работники, занятые подготовкой информации, оформлением документации и учетом");
	Для Каждого Имя Из Занятия Цикл
		НайтиИлиСоздатьЭлемент("КлассификаторЗанятий", Имя);
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьСтраныМира()
	// Классификатор стран мира (ОКСМ)
	Страны = Новый Массив;
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "895", "АБХАЗИЯ", "Республика Абхазия", "Abkhazia", "AB", "ABH", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "036", "АВСТРАЛИЯ", "Австралийский Союз", "Australia", "AU", "AUS", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "040", "АВСТРИЯ", "Австрийская Республика", "Austria", "AT", "AUT", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "031", "АЗЕРБАЙДЖАН", "Республика Азербайджан", "Azerbaijan", "AZ", "AZE", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "008", "АЛБАНИЯ", "Республика Албания", "Albania", "AL", "ALB", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "012", "АЛЖИР", "Алжирская Народная Демократическая Республика", "Algeria", "DZ", "DZA", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "051", "АРМЕНИЯ", "Республика Армения", "Armenia", "AM", "ARM", Истина));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "004", "АФГАНИСТАН", "Исламское Государство Афганистан", "Afghanistan", "AF", "AFG", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "112", "БЕЛАРУСЬ", "Республика Беларусь", "Belarus", "BY", "BLR", Истина));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "056", "БЕЛЬГИЯ", "Королевство Бельгия", "Belgium", "BE", "BEL", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "100", "БОЛГАРИЯ", "Республика Болгария", "Bulgaria", "BG", "BGR", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "076", "БРАЗИЛИЯ", "Федеративная Республика Бразилия", "Brazil", "BR", "BRA", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "826", "ВЕЛИКОБРИТАНИЯ", "Соединенное Королевство Великобритании и Северной Ирландии", "United Kingdom", "GB", "GBR", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "348", "ВЕНГРИЯ", "Венгрия", "Hungary", "HU", "HUN", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "704", "ВЬЕТНАМ", "Социалистическая Республика Вьетнам", "Viet Nam", "VN", "VTM", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "276", "ГЕРМАНИЯ", "Федеративная Республика Германия", "Germany", "DE", "DEU", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "300", "ГРЕЦИЯ", "Греческая Республика", "Greece", "GR", "GRC", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "268", "ГРУЗИЯ", "Грузия", "Georgia", "GE", "GEO", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "208", "ДАНИЯ", "Королевство Дания", "Denmark", "DK", "DNK", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "818", "ЕГИПЕТ", "Арабская Республика Египет", "Egypt", "EG", "EGY", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "356", "ИНДИЯ", "Республика Индия", "India", "IN", "IND", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "368", "ИРАК", "Республика Ирак", "Iraq", "IQ", "IRQ", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "364", "ИРАН", "Исламская Республика Иран", "Iran", "IR", "IRN", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "724", "ИСПАНИЯ", "Королевство Испания", "Spain", "ES", "ESP", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "380", "ИТАЛИЯ", "Итальянская Республика", "Italy", "IT", "ITA", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "398", "КАЗАХСТАН", "Республика Казахстан", "Kazakhstan", "KZ", "KAZ", Истина));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "124", "КАНАДА", "Канада", "Canada", "CA", "CAN", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "156", "КИТАЙ", "Китайская Народная Республика", "China", "CN", "CHN", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "417", "КИРГИЗИЯ", "Кыргызская Республика", "Kyrgyzstan", "KG", "KGZ", Истина));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "428", "ЛАТВИЯ", "Латвийская Республика", "Latvia", "LV", "LVA", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "440", "ЛИТВА", "Литовская Республика", "Lithuania", "LT", "LTU", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "498", "МОЛДОВА", "Республика Молдова", "Moldova", "MD", "MDA", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "616", "ПОЛЬША", "Республика Польша", "Poland", "PL", "POL", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "643", "РОССИЯ", "Российская Федерация", "Russian Federation", "RU", "RUS", Истина));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "642", "РУМЫНИЯ", "Румыния", "Romania", "RO", "ROU", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "688", "СЕРБИЯ", "Республика Сербия", "Serbia", "RS", "SRB", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "703", "СЛОВАКИЯ", "Словацкая Республика", "Slovakia", "SK", "SVK", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "705", "СЛОВЕНИЯ", "Республика Словения", "Slovenia", "SI", "SVN", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "840", "США", "Соединенные Штаты Америки", "United States", "US", "USA", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "762", "ТАДЖИКИСТАН", "Республика Таджикистан", "Tajikistan", "TJ", "TJK", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "792", "ТУРЦИЯ", "Турецкая Республика", "Turkey", "TR", "TUR", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "795", "ТУРКМЕНИСТАН", "Туркменистан", "Turkmenistan", "TM", "TKM", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "860", "УЗБЕКИСТАН", "Республика Узбекистан", "Uzbekistan", "UZ", "UZB", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "804", "УКРАИНА", "Украина", "Ukraine", "UA", "UKR", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "246", "ФИНЛЯНДИЯ", "Финляндская Республика", "Finland", "FI", "FIN", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "250", "ФРАНЦИЯ", "Французская Республика", "France", "FR", "FRA", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "191", "ХОРВАТИЯ", "Республика Хорватия", "Croatia", "HR", "HRV", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "203", "ЧЕШСКАЯ РЕСПУБЛИКА", "Чешская Республика", "Czech Republic", "CZ", "CZE", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "756", "ШВЕЙЦАРИЯ", "Швейцарская Конфедерация", "Switzerland", "CH", "CHE", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "752", "ШВЕЦИЯ", "Королевство Швеция", "Sweden", "SE", "SWE", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "233", "ЭСТОНИЯ", "Эстонская Республика", "Estonia", "EE", "EST", Ложь));
	Страны.Добавить(Новый Структура("Код,Наименование,Полное,Международное,Альфа2,Альфа3,ЕАЭС", "392", "ЯПОНИЯ", "Япония", "Japan", "JP", "JPN", Ложь));

	Для Каждого Страна Из Страны Цикл
		Ссылка = Справочники.СтраныМира.НайтиПоКоду(Страна.Код, Ложь);
		Если ЗначениеЗаполнено(Ссылка) И Не Ссылка.Пустая() Тогда
			Продолжить;
		КонецЕсли;
		Объект = Справочники.СтраныМира.СоздатьЭлемент();
		Объект.Код = Страна.Код;
		Объект.Наименование = Страна.Наименование;
		Объект.ПолноеНаименование = Страна.Полное;
		Объект.МеждународноеНаименование = Страна.Международное;
		Объект.КодАльфа2 = Страна.Альфа2;
		Объект.КодАльфа3 = Страна.Альфа3;
		Объект.УчастникЕАЭС = Страна.ЕАЭС;
		Объект.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьНадбавки()
	Если Справочники.Надбавки.Выбрать().Следующий() Тогда
		Возврат;
	КонецЕсли;

	Надбавка = НовыйЭлементСправочника("Надбавки", "000000006", "за выс. дост. в труде %");
	Надбавка.ПолноеНаименование = "за высокие достижения в труде";
	Надбавка.Финансирование = Перечисления.ИсточникФинансирования.Бюджет;
	Надбавка.ЕдИзм = Перечисления.ЕдИзм.Процент;
	Надбавка.ВидПечати = Перечисления.ВидПечатиНадбавок.Размер;
	Надбавка.Статус = Перечисления.СтатусыНадбавок.НадбавкаОклада;
	Надбавка.Установщик = Перечисления.УстановщикНадбавки.ПОО;
	Надбавка.Записать();

	Надбавка = НовыйЭлементСправочника("Надбавки", "000000010", "за допуск к гос секретам");
	Надбавка.ПолноеНаименование = "за допуск к государственным секретам";
	Надбавка.Финансирование = Перечисления.ИсточникФинансирования.Бюджет;
	Надбавка.ЕдИзм = Перечисления.ЕдИзм.Процент;
	Надбавка.ВидПечати = Перечисления.ВидПечатиНадбавок.Размер;
	Надбавка.Статус = Перечисления.СтатусыНадбавок.НадбавкаОклада;
	Надбавка.Записать();

	Надбавка = НовыйЭлементСправочника("Надбавки", "000000015", "за кураторство 1-3 курс");
	Надбавка.ПолноеНаименование = "за кураторство 1-3 курс";
	Надбавка.Финансирование = Перечисления.ИсточникФинансирования.Внебюджет;
	Надбавка.ЕдИзм = Перечисления.ЕдИзм.Процент;
	Надбавка.ВидПечати = Перечисления.ВидПечатиНадбавок.Сумма;
	Надбавка.Статус = Перечисления.СтатусыНадбавок.НадбБазовойСт;
	Надбавка.Записать();

	Надбавка = НовыйЭлементСправочника("Надбавки", "000000016", "за стаж в бюдж.орг.");
	Надбавка.ПолноеНаименование = "за стаж в бюджетных организациях";
	Надбавка.Финансирование = Перечисления.ИсточникФинансирования.Бюджет;
	Надбавка.ЕдИзм = Перечисления.ЕдИзм.Процент;
	Надбавка.ВидПечати = Перечисления.ВидПечатиНадбавок.Размер;
	Надбавка.Статус = Перечисления.СтатусыНадбавок.НадбавкаОклада;
	Надбавка.Записать();

	Надбавка = НовыйЭлементСправочника("Надбавки", "000000017", "по контракту");
	Надбавка.ПолноеНаименование = "надбавка по контракту";
	Надбавка.Финансирование = Перечисления.ИсточникФинансирования.Бюджет;
	Надбавка.ЕдИзм = Перечисления.ЕдИзм.Процент;
	Надбавка.ВидПечати = Перечисления.ВидПечатиНадбавок.Размер;
	Надбавка.Статус = Перечисления.СтатусыНадбавок.НадбавкаОклада;
	Надбавка.Записать();
КонецПроцедуры

Функция НайтиИлиСоздатьГруппуДолжностей(Код, Наименование)
	Ссылка = Справочники.Должности.НайтиПоКоду(Код, Ложь);
	Если ЗначениеЗаполнено(Ссылка) И Не Ссылка.Пустая() Тогда
		Возврат Ссылка;
	КонецЕсли;
	Объект = Справочники.Должности.СоздатьГруппу();
	Объект.Код = Код;
	Объект.Наименование = Наименование;
	Объект.Записать();
	Возврат Объект.Ссылка;
КонецФункции

Процедура ЗагрузитьДолжности()
	ГруппаВФ = НайтиИлиСоздатьГруппуДолжностей("000000001", "ВФ");
	ГруппаДругие = НайтиИлиСоздатьГруппуДолжностей("000000017", "Другие служащие");
	ГруппаПреподаватели = НайтиИлиСоздатьГруппуДолжностей("000000041", "Преподаватели");
	НайтиИлиСоздатьГруппуДолжностей("000000049", "рабочие");
	ГруппаРуководители = НайтиИлиСоздатьГруппуДолжностей("000000207", "руководители");
	НайтиИлиСоздатьГруппуДолжностей("000000227", "руководители ППС");
	ГруппаСпециалисты = НайтиИлиСоздатьГруппуДолжностей("000000281", "специалисты");

	Ссылка = Справочники.Должности.НайтиПоКоду("000000008", Ложь);
	Если Не ЗначениеЗаполнено(Ссылка) Или Ссылка.Пустая() Тогда
		Объект = Справочники.Должности.СоздатьЭлемент();
		Объект.Код = "000000008";
		Объект.Наименование = "Библиограф";
		Объект.Родитель = ГруппаСпециалисты;
		Объект.Имя = "Библиограф";
		Объект.ПолноеНаименование = "Библиограф 1-й категории";
		Объект.СокращенноеНаименование = "Библиограф";
		Объект.Категория = "1";
		Объект.КодДолжности = "2622-001-02-1-00";
		Объект.ВидДолжности = Справочники.ВидДолжности.НайтиПоНаименованию("специалисты", Истина);
		Объект.ОсновнойОтпуск = 24;
		Объект.ДополнительныйОтпуск = 0;
		Объект.Разряд = 7;
		Объект.ПоправочныйКоэффициент = 0;
		Объект.Записать();
	КонецЕсли;

	Ссылка = Справочники.Должности.НайтиПоКоду("000000167", Ложь);
	Если Не ЗначениеЗаполнено(Ссылка) Или Ссылка.Пустая() Тогда
		Объект = Справочники.Должности.СоздатьЭлемент();
		Объект.Код = "000000167";
		Объект.Наименование = "Ректор";
		Объект.Родитель = ГруппаРуководители;
		Объект.ПолноеНаименование = "Ректор";
		Объект.ВидДолжности = Справочники.ВидДолжности.НайтиПоНаименованию("руководители", Истина);
		Объект.ОсновнойОтпуск = 28;
		Объект.Разряд = 25;
		Объект.Записать();
	КонецЕсли;

	Ссылка = Справочники.Должности.НайтиПоКоду("000000042", Ложь);
	Если Не ЗначениеЗаполнено(Ссылка) Или Ссылка.Пустая() Тогда
		Объект = Справочники.Должности.СоздатьЭлемент();
		Объект.Код = "000000042";
		Объект.Наименование = "Преподаватель";
		Объект.Родитель = ГруппаПреподаватели;
		Объект.ПолноеНаименование = "Преподаватель";
		Объект.ВидДолжности = Справочники.ВидДолжности.НайтиПоНаименованию("Преподаватели", Истина);
		Объект.ОсновнойОтпуск = 56;
		Объект.ОтношениеКПедагогическомуПерсоналу = Истина;
		Объект.Записать();
	КонецЕсли;

	СоответствиеГрупп = Новый Соответствие;
	СоответствиеГрупп.Вставить(ГруппаВФ, "ВФ");
	СоответствиеГрупп.Вставить(ГруппаДругие, "Другие служащие");
	СоответствиеГрупп.Вставить(ГруппаПреподаватели, "Преподаватели");
	СоответствиеГрупп.Вставить(ГруппаРуководители, "руководители");
	СоответствиеГрупп.Вставить(ГруппаСпециалисты, "специалисты");
	Для Каждого КлючИЗначение Из СоответствиеГрупп Цикл
		Объект = КлючИЗначение.Ключ.ПолучитьОбъект();
		Если Не ЗначениеЗаполнено(Объект.ВидДолжности) Тогда
			Объект.ВидДолжности = Справочники.ВидДолжности.НайтиПоНаименованию(КлючИЗначение.Значение, Истина);
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция НайтиИлиСоздатьГруппуПодразделений(Наименование, Код, КодПодразделения, ПолноеНаименование)
	Ссылка = Справочники.Подразделения.НайтиПоНаименованию(Наименование, Истина);
	Если ЗначениеЗаполнено(Ссылка) И Не Ссылка.Пустая() Тогда
		Если Ссылка.ЭтоГруппа Тогда
			Возврат Ссылка;
		КонецЕсли;
		// существовал как обычный элемент — переделываем в группу
		Ссылка.ПолучитьОбъект().Удалить();
	КонецЕсли;
	Группа = Справочники.Подразделения.СоздатьГруппу();
	Группа.Код = Код;
	Группа.Наименование = Наименование;
	Группа.ПолноеНаименование = ПолноеНаименование;
	Группа.КраткоеНаименование = Наименование;
	Группа.КодПодразделения = КодПодразделения;
	Группа.Записать();
	Возврат Группа.Ссылка;
КонецФункции

Процедура ЗагрузитьПодразделения()
	// Группы для иерархии
	Ректорат = НайтиИлиСоздатьГруппуПодразделений("Ректорат", "000000161", "100000000", "Ректорат");
	СтруктурныеПодразделения = НайтиИлиСоздатьГруппуПодразделений("Структурные подразделения", "000000180", "100000000", "Структурные подразделения");

	// Элементы: Ректор входит в группу «Ректорат», остальные — в «Структурные подразделения»
	Подразделения = Новый Массив;
	Подразделения.Добавить(Новый Структура("Код,КодПодразделения,Наименование,Полное,Краткое,Родитель", "000000167", "100000000", "Ректор", "Ректор", "Ректор", Ректорат));
	Подразделения.Добавить(Новый Структура("Код,КодПодразделения,Наименование,Полное,Краткое,Родитель", "000000168", "101000000", "Бухгалтерия", "Бухгалтерия", "Бухгалтерия", СтруктурныеПодразделения));
	Подразделения.Добавить(Новый Структура("Код,КодПодразделения,Наименование,Полное,Краткое,Родитель", "000000175", "103000000", "ЦКР", "Центр контроля качества подготовки специалистов", "ЦКР", СтруктурныеПодразделения));
	Подразделения.Добавить(Новый Структура("Код,КодПодразделения,Наименование,Полное,Краткое,Родитель", "000000174", "103000000", "Юр.отд", "Юридический отдел", "Юр.отд", СтруктурныеПодразделения));
	Подразделения.Добавить(Новый Структура("Код,КодПодразделения,Наименование,Полное,Краткое,Родитель", "000000173", "104000000", "СПиЧС", "Отдел по спецподготовке и чрезвычайным ситуациям", "СПиЧС", СтруктурныеПодразделения));
	Подразделения.Добавить(Новый Структура("Код,КодПодразделения,Наименование,Полное,Краткое,Родитель", "000000165", "106000000", "ЦПОУ", "Центр профориентационной работы", "ЦПОУ", СтруктурныеПодразделения));

	Для Каждого Подразделение Из Подразделения Цикл
		Ссылка = Справочники.Подразделения.НайтиПоКоду(Подразделение.Код, Ложь);
		Если ЗначениеЗаполнено(Ссылка) И Не Ссылка.Пустая() Тогда
			Объект = Ссылка.ПолучитьОбъект();
		Иначе
			Объект = Справочники.Подразделения.СоздатьЭлемент();
			Объект.Код = Подразделение.Код;
		КонецЕсли;
		Объект.Наименование = Подразделение.Наименование;
		Объект.ПолноеНаименование = Подразделение.Полное;
		Объект.КраткоеНаименование = Подразделение.Краткое;
		Объект.КодПодразделения = Подразделение.КодПодразделения;
		Объект.Родитель = Подразделение.Родитель;
		Объект.Записать();
	КонецЦикла;
КонецПроцедуры

Процедура ЗагрузитьСотрудников()
	Если Справочники.Сотрудники.Выбрать().Следующий() Тогда
		Возврат;
	КонецЕсли;

	ПодразделениеРектор = Справочники.Подразделения.НайтиПоНаименованию("Ректор", Истина);
	ДолжностьРектор = Справочники.Должности.НайтиПоКоду("000000167", Ложь);
	Банк = Справочники.БанкиРБ.НайтиПоНаименованию("ОАО «АСБ Беларбанк»", Истина);
	Улица = Справочники.Адрес.НайтиПоНаименованию("ул. Платонова", Истина);

	// Сотрудник 1: Богуш Вадим Анатольевич — ректор
	Объект = Справочники.Сотрудники.СоздатьЭлемент();
	Объект.Код = "000000001";
	Объект.ТабельныйНомер = "00000001";
	Объект.Наименование = "Богуш Вадим Анатольевич";
	Объект.Фамилия = "Богуш";
	Объект.Имя = "Вадим";
	Объект.Отчество = "Анатольевич";
	Объект.ФамилияИО = "Богуш В.А.";
	Объект.Пол = Перечисления.Пол.Мужской;
	Объект.ДатаРождения = Дата(1970, 5, 14);
	Объект.СемейноеПоложение = Перечисления.СемейноеПоложение.Ж;
	Объект.КодОператора = Перечисления.КодыМобильныхОператоровБеларуси.A1;
	Объект.Телефон = "291111111";
	Объект.ДокументУдостоверяющийЛичность = Перечисления.ДокументыУдостоверяющиеЛичность.ПаспортРБ;
	Объект.Гражданство = Перечисления.СтраныМира.Беларусь;
	Объект.Подразделение = ПодразделениеРектор;
	Объект.Должность = ДолжностьРектор;
	Объект.ВидКомплектования = Перечисления.ВидКомплектования.ТрудовойДоговор;
	Объект.ВидРаботы = Перечисления.ВидРаботы.Основная;
	Объект.РазмерСтавки = 1;
	Объект.ТарифныйРазряд = 25;
	Объект.Стаж = Дата(1995, 9, 1);
	Объект.ГрафикРаботы = Перечисления.ГрафикРаботы.ПятидневнаяНеделя;
	Объект.ДатаПриемаНаРаботу = Дата(2015, 8, 17);
	Объект.Статус = Перечисления.СтатусСотрудника.Работает;
	Объект.ОсновнаяРабота = "Основное место работы";
	Объект.Страна = Перечисления.СтраныМира.Беларусь;
	Объект.Улица = Улица;
	Объект.Дом = "22";
	Объект.Банк = Банк;
	Объект.Записать();

	СтрокаИстории = Объект.ИсторияРабот.Добавить();
	СтрокаИстории.ДатаС = Дата(1995, 9, 1);
	СтрокаИстории.ДатаПо = Дата(2015, 8, 16);
	СтрокаИстории.Организация = "БГУИР";
	СтрокаИстории.ДолжностьСтрокой = "Преподаватель";
	СтрокаИстории.ВключатьВСтаж = Истина;
	СтрокаИстории = Объект.ИсторияРабот.Добавить();
	СтрокаИстории.ДатаС = Дата(2015, 8, 17);
	СтрокаИстории.Организация = "БГУИР";
	СтрокаИстории.ДолжностьСтрокой = "Ректор";
	СтрокаИстории.ВключатьВСтаж = Истина;
	Объект.Записать();

	// Сотрудник 2: Иванов Иван Иванович
	Объект = Справочники.Сотрудники.СоздатьЭлемент();
	Объект.Код = "000000002";
	Объект.ТабельныйНомер = "00000002";
	Объект.Наименование = "Иванов Иван Иванович";
	Объект.Фамилия = "Иванов";
	Объект.Имя = "Иван";
	Объект.Отчество = "Иванович";
	Объект.ФамилияИО = "Иванов И.И.";
	Объект.Пол = Перечисления.Пол.Мужской;
	Объект.ДатаРождения = Дата(1990, 3, 2);
	Объект.КодОператора = Перечисления.КодыМобильныхОператоровБеларуси.МТС;
	Объект.Телефон = "295222222";
	Объект.ДокументУдостоверяющийЛичность = Перечисления.ДокументыУдостоверяющиеЛичность.ПаспортРБ;
	Объект.Гражданство = Перечисления.СтраныМира.Беларусь;
	Объект.ДатаПолученияМедСправки = Дата(2026, 8, 6);
	Объект.СрокГодностиМедСправки = Дата(2028, 8, 5);
	Объект.Подразделение = ПодразделениеРектор;
	Объект.Должность = Справочники.Должности.НайтиПоКоду("000000008", Ложь);
	Объект.ВидКомплектования = Перечисления.ВидКомплектования.ТрудовойДоговор;
	Объект.ВидРаботы = Перечисления.ВидРаботы.Основная;
	Объект.РазмерСтавки = 1;
	Объект.ТарифныйРазряд = 7;
	Объект.Стаж = Дата(2014, 12, 5);
	Объект.ГрафикРаботы = Перечисления.ГрафикРаботы.ПятидневнаяНеделя;
	Объект.ДатаПриемаНаРаботу = Дата(2019, 12, 5);
	Объект.Статус = Перечисления.СтатусСотрудника.Работает;
	Объект.Страна = Перечисления.СтраныМира.Беларусь;
	Объект.Банк = Банк;
	Объект.Записать();

	СтрокаСтажа = Объект.ВидыСтажа.Добавить();
	СтрокаСтажа.ВидСтажа = "Бюджетный";
	СтрокаСтажа.Лет = 11;
	СтрокаСтажа.Месяцев = 18;
	СтрокаСтажа.ДатаРасчета = Дата(2019, 12, 5);

	СтрокаСведений = Объект.СведенияСтажа.Добавить();
	СтрокаСведений.НомерУдостоверения = "АА 676767";
	СтрокаСведений.Сведение = "член Профсоюза";
	СтрокаСведений.ДатаНачала = Дата(2024, 4, 1);

	СтрокаНадбавки = Объект.Надбавки.Добавить();
	СтрокаНадбавки.Надбавка = Справочники.Надбавки.НайтиПоНаименованию("за стаж в бюдж.орг.", Истина);
	СтрокаНадбавки.Размер = 30;
	СтрокаНадбавки.ЕдИзм = Перечисления.ЕдИзм.Процент;
	СтрокаНадбавки.ДатаНачала = Дата(2023, 11, 17);
	СтрокаНадбавки = Объект.Надбавки.Добавить();
	СтрокаНадбавки.Надбавка = Справочники.Надбавки.НайтиПоНаименованию("по контракту", Истина);
	СтрокаНадбавки.Размер = 50;
	СтрокаНадбавки.ЕдИзм = Перечисления.ЕдИзм.Процент;
	СтрокаНадбавки.ДатаНачала = Дата(2020, 5, 1);

	СтрокаРебенка = Объект.Дети.Добавить();
	СтрокаРебенка.ФИОРебенка = "Иванов Пётр Иванович";
	СтрокаРебенка.ДатаРожденияРебенка = Дата(2018, 6, 10);

	СтрокаОбразования = Объект.Образование.Добавить();
	СтрокаОбразования.УчебноеЗаведение = "БГУИР";
	СтрокаОбразования.Специальность = "Программное обеспечение информационных технологий";
	СтрокаОбразования.ГодОкончания = 2013;
	Объект.Записать();

	// Руководитель подразделения «Ректор» и группы «Ректорат»
	СсылкаБогуш = Справочники.Сотрудники.НайтиПоНаименованию("Богуш Вадим Анатольевич", Истина);
	Если ЗначениеЗаполнено(СсылкаБогуш) Тогда
		Если ЗначениеЗаполнено(ПодразделениеРектор) Тогда
			ОбъектПодразделения = ПодразделениеРектор.ПолучитьОбъект();
			ОбъектПодразделения.Руководитель = СсылкаБогуш;
			ОбъектПодразделения.Записать();
		КонецЕсли;
		Ректорат = Справочники.Подразделения.НайтиПоНаименованию("Ректорат", Истина);
		Если ЗначениеЗаполнено(Ректорат) Тогда
			ОбъектРектората = Ректорат.ПолучитьОбъект();
			ОбъектРектората.Руководитель = СсылкаБогуш;
			ОбъектРектората.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
